hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_spi_regs.h
/*
 * Copyright (c) 2021-2026 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_SPI_H
#define HPM_SPI_H

typedef struct {
    __R  uint8_t  RESERVED0[4];                /* 0x0 - 0x3: Reserved */
    __RW uint32_t WR_TRANS_CNT;                /* 0x4: Transfer count for write data */
    __RW uint32_t RD_TRANS_CNT;                /* 0x8: Transfer count for read data */
    __R  uint8_t  RESERVED1[4];                /* 0xC - 0xF: Reserved */
    __RW uint32_t TRANSFMT;                    /* 0x10: Transfer Format Register */
    __RW uint32_t DIRECTIO;                    /* 0x14: Direct IO Control Register */
    __R  uint8_t  RESERVED2[8];                /* 0x18 - 0x1F: Reserved */
    __RW uint32_t TRANSCTRL;                   /* 0x20: Transfer Control Register */
    __RW uint32_t CMD;                         /* 0x24: Command Register */
    __RW uint32_t ADDR;                        /* 0x28: Address Register */
    __RW uint32_t DATA;                        /* 0x2C: Data Register */
    __RW uint32_t CTRL;                        /* 0x30: Control Register */
    __R  uint32_t STATUS;                      /* 0x34: Status Register */
    __RW uint32_t INTREN;                      /* 0x38: Interrupt Enable Register */
    __W  uint32_t INTRST;                      /* 0x3C: Interrupt Status Register */
    __RW uint32_t TIMING;                      /* 0x40: Interface Timing Register */
    __R  uint8_t  RESERVED3[28];               /* 0x44 - 0x5F: Reserved */
    __RW uint32_t SLVST;                       /* 0x60: Slave Status Register */
    __R  uint32_t SLVDATACNT;                  /* 0x64: Slave Data Count Register */
    __R  uint32_t SLVDATAWCNT;                 /* 0x68: WCnt */
    __R  uint32_t SLVDATARCNT;                 /* 0x6C: RCnt */
    __R  uint8_t  RESERVED4[12];               /* 0x70 - 0x7B: Reserved */
    __R  uint32_t CONFIG;                      /* 0x7C: Configuration Register */
} SPI_Type;


/* Bitfield definition for register: WR_TRANS_CNT */
/*
 * WRTRANCNT (RW)
 *
 * Transfer count for write data
 * WrTranCnt indicates the number of units of data to be transmitted to the SPI bus from the Data Register. The actual transfer count is (WrTranCnt+1).
 * WrTranCnt only takes effect when TransMode is 0, 1, 3, 4, 5, 6 or 8.
 * The size (bit-width) of a data unit is defined by the DataLen field of the Transfer Format Register.
 * For TransMode 0, WrTranCnt must be equal to RdTranCnt.
 */
#define SPI_WR_TRANS_CNT_WRTRANCNT_MASK (0xFFFFFFFFUL)
#define SPI_WR_TRANS_CNT_WRTRANCNT_SHIFT (0U)
#define SPI_WR_TRANS_CNT_WRTRANCNT_SET(x) (((uint32_t)(x) << SPI_WR_TRANS_CNT_WRTRANCNT_SHIFT) & SPI_WR_TRANS_CNT_WRTRANCNT_MASK)
#define SPI_WR_TRANS_CNT_WRTRANCNT_GET(x) (((uint32_t)(x) & SPI_WR_TRANS_CNT_WRTRANCNT_MASK) >> SPI_WR_TRANS_CNT_WRTRANCNT_SHIFT)

/* Bitfield definition for register: RD_TRANS_CNT */
/*
 * RDTRANCNT (RW)
 *
 * Transfer count for read data
 * RdTranCnt indicates the number of units of data to be received from SPI bus and stored to the Data Register. The actual received count is (RdTranCnt+1).
 * RdTransCnt only takes effect when TransMode is 0, 2, 3, 4, 5, 6 or 9.
 * The size (bit-width) of a data unit is defined by the DataLen field of the Transfer Format Register.
 * For TransMode 0, WrTranCnt must equal RdTranCnt.
 */
#define SPI_RD_TRANS_CNT_RDTRANCNT_MASK (0xFFFFFFFFUL)
#define SPI_RD_TRANS_CNT_RDTRANCNT_SHIFT (0U)
#define SPI_RD_TRANS_CNT_RDTRANCNT_SET(x) (((uint32_t)(x) << SPI_RD_TRANS_CNT_RDTRANCNT_SHIFT) & SPI_RD_TRANS_CNT_RDTRANCNT_MASK)
#define SPI_RD_TRANS_CNT_RDTRANCNT_GET(x) (((uint32_t)(x) & SPI_RD_TRANS_CNT_RDTRANCNT_MASK) >> SPI_RD_TRANS_CNT_RDTRANCNT_SHIFT)

/* Bitfield definition for register: TRANSFMT */
/*
 * ADDRLEN (RW)
 *
 * Address length in bytes
 * 0x0: 1 byte
 * 0x1: 2 bytes
 * 0x2: 3 bytes
 * 0x3: 4 bytes
 */
#define SPI_TRANSFMT_ADDRLEN_MASK (0x30000UL)
#define SPI_TRANSFMT_ADDRLEN_SHIFT (16U)
#define SPI_TRANSFMT_ADDRLEN_SET(x) (((uint32_t)(x) << SPI_TRANSFMT_ADDRLEN_SHIFT) & SPI_TRANSFMT_ADDRLEN_MASK)
#define SPI_TRANSFMT_ADDRLEN_GET(x) (((uint32_t)(x) & SPI_TRANSFMT_ADDRLEN_MASK) >> SPI_TRANSFMT_ADDRLEN_SHIFT)

/*
 * DATALEN (RW)
 *
 * The length of each data unit in bits
 * The actual bit number of a data unit is (DataLen + 1)
 */
#define SPI_TRANSFMT_DATALEN_MASK (0x1F00U)
#define SPI_TRANSFMT_DATALEN_SHIFT (8U)
#define SPI_TRANSFMT_DATALEN_SET(x) (((uint32_t)(x) << SPI_TRANSFMT_DATALEN_SHIFT) & SPI_TRANSFMT_DATALEN_MASK)
#define SPI_TRANSFMT_DATALEN_GET(x) (((uint32_t)(x) & SPI_TRANSFMT_DATALEN_MASK) >> SPI_TRANSFMT_DATALEN_SHIFT)

/*
 * DATAMERGE (RW)
 *
 * Enable Data Merge mode, which does automatic data split on write and data coalescing on read.
 * This bit only takes effect when DataLen = 0x7. Under Data Merge mode, each write to the Data Register will transmit all fourbytes of the write data; each read from the Data Register will retrieve four bytes of received data as a single word data.
 * When Data Merge mode is disabled, only the least (DataLen+1) significient bits of the Data Register are valid for read/write operations; no automatic data split/coalescing will be performed.
 */
#define SPI_TRANSFMT_DATAMERGE_MASK (0x80U)
#define SPI_TRANSFMT_DATAMERGE_SHIFT (7U)
#define SPI_TRANSFMT_DATAMERGE_SET(x) (((uint32_t)(x) << SPI_TRANSFMT_DATAMERGE_SHIFT) & SPI_TRANSFMT_DATAMERGE_MASK)
#define SPI_TRANSFMT_DATAMERGE_GET(x) (((uint32_t)(x) & SPI_TRANSFMT_DATAMERGE_MASK) >> SPI_TRANSFMT_DATAMERGE_SHIFT)

/*
 * MOSIBIDIR (RW)
 *
 * Bi-directional MOSI in regular (single) mode
 * 0x0: MOSI is uni-directional signal in regular mode.
 * 0x1: MOSI is bi-directional signal in regular mode. This bi-directional signal replaces the two
 */
#define SPI_TRANSFMT_MOSIBIDIR_MASK (0x10U)
#define SPI_TRANSFMT_MOSIBIDIR_SHIFT (4U)
#define SPI_TRANSFMT_MOSIBIDIR_SET(x) (((uint32_t)(x) << SPI_TRANSFMT_MOSIBIDIR_SHIFT) & SPI_TRANSFMT_MOSIBIDIR_MASK)
#define SPI_TRANSFMT_MOSIBIDIR_GET(x) (((uint32_t)(x) & SPI_TRANSFMT_MOSIBIDIR_MASK) >> SPI_TRANSFMT_MOSIBIDIR_SHIFT)

