hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_spi_regs.h
/*
 * ENDINTEN (RW)
 *
 * Enable the End of SPI Transfer interrupt.
 * Control whether interrupts are triggered when SPI transfers end.
 * (In slave mode, end of read status transaction doesn鈥檛 trigger this interrupt.)
 */
#define SPI_INTREN_ENDINTEN_MASK (0x10U)
#define SPI_INTREN_ENDINTEN_SHIFT (4U)
#define SPI_INTREN_ENDINTEN_SET(x) (((uint32_t)(x) << SPI_INTREN_ENDINTEN_SHIFT) & SPI_INTREN_ENDINTEN_MASK)
#define SPI_INTREN_ENDINTEN_GET(x) (((uint32_t)(x) & SPI_INTREN_ENDINTEN_MASK) >> SPI_INTREN_ENDINTEN_SHIFT)

/*
 * TXFIFOINTEN (RW)
 *
 * Enable the SPI Transmit FIFO Threshold interrupt.
 * Control whether interrupts are triggered when the valid entries are less than or equal to the TX FIFO threshold.
 */
#define SPI_INTREN_TXFIFOINTEN_MASK (0x8U)
#define SPI_INTREN_TXFIFOINTEN_SHIFT (3U)
#define SPI_INTREN_TXFIFOINTEN_SET(x) (((uint32_t)(x) << SPI_INTREN_TXFIFOINTEN_SHIFT) & SPI_INTREN_TXFIFOINTEN_MASK)
#define SPI_INTREN_TXFIFOINTEN_GET(x) (((uint32_t)(x) & SPI_INTREN_TXFIFOINTEN_MASK) >> SPI_INTREN_TXFIFOINTEN_SHIFT)

/*
 * RXFIFOINTEN (RW)
 *
 * Enable the SPI Receive FIFO Threshold interrupt.
 * Control whether interrupts are triggered when the valid entries are greater than or equal to the RX FIFO threshold.
 */
#define SPI_INTREN_RXFIFOINTEN_MASK (0x4U)
#define SPI_INTREN_RXFIFOINTEN_SHIFT (2U)
#define SPI_INTREN_RXFIFOINTEN_SET(x) (((uint32_t)(x) << SPI_INTREN_RXFIFOINTEN_SHIFT) & SPI_INTREN_RXFIFOINTEN_MASK)
#define SPI_INTREN_RXFIFOINTEN_GET(x) (((uint32_t)(x) & SPI_INTREN_RXFIFOINTEN_MASK) >> SPI_INTREN_RXFIFOINTEN_SHIFT)

/*
 * TXFIFOURINTEN (RW)
 *
 * Enable the SPI Transmit FIFO Underrun interrupt.
 * Control whether interrupts are triggered when the Transmit FIFO run out of data.
 * (Slave mode only)
 */
#define SPI_INTREN_TXFIFOURINTEN_MASK (0x2U)
#define SPI_INTREN_TXFIFOURINTEN_SHIFT (1U)
#define SPI_INTREN_TXFIFOURINTEN_SET(x) (((uint32_t)(x) << SPI_INTREN_TXFIFOURINTEN_SHIFT) & SPI_INTREN_TXFIFOURINTEN_MASK)
#define SPI_INTREN_TXFIFOURINTEN_GET(x) (((uint32_t)(x) & SPI_INTREN_TXFIFOURINTEN_MASK) >> SPI_INTREN_TXFIFOURINTEN_SHIFT)

/*
 * RXFIFOORINTEN (RW)
 *
 * Enable the SPI Receive FIFO Overrun interrupt.
 * Control whether interrupts are triggered when the Receive FIFO overflows.
 * (Slave mode only)
 */
#define SPI_INTREN_RXFIFOORINTEN_MASK (0x1U)
#define SPI_INTREN_RXFIFOORINTEN_SHIFT (0U)
#define SPI_INTREN_RXFIFOORINTEN_SET(x) (((uint32_t)(x) << SPI_INTREN_RXFIFOORINTEN_SHIFT) & SPI_INTREN_RXFIFOORINTEN_MASK)
#define SPI_INTREN_RXFIFOORINTEN_GET(x) (((uint32_t)(x) & SPI_INTREN_RXFIFOORINTEN_MASK) >> SPI_INTREN_RXFIFOORINTEN_SHIFT)

/* Bitfield definition for register: INTRST */
/*
 * CS_NEGINT (W1C)
 *
 * Cs posedge edge interrupt
 * (Slave mode only)
 */
#define SPI_INTRST_CS_NEGINT_MASK (0x80U)
#define SPI_INTRST_CS_NEGINT_SHIFT (7U)
#define SPI_INTRST_CS_NEGINT_SET(x) (((uint32_t)(x) << SPI_INTRST_CS_NEGINT_SHIFT) & SPI_INTRST_CS_NEGINT_MASK)
#define SPI_INTRST_CS_NEGINT_GET(x) (((uint32_t)(x) & SPI_INTRST_CS_NEGINT_MASK) >> SPI_INTRST_CS_NEGINT_SHIFT)

/*
 * CS_POSINT (W1C)
 *
 * Cs posedge edge interrupt
 * (Slave mode only)
 */
#define SPI_INTRST_CS_POSINT_MASK (0x40U)
#define SPI_INTRST_CS_POSINT_SHIFT (6U)
#define SPI_INTRST_CS_POSINT_SET(x) (((uint32_t)(x) << SPI_INTRST_CS_POSINT_SHIFT) & SPI_INTRST_CS_POSINT_MASK)
#define SPI_INTRST_CS_POSINT_GET(x) (((uint32_t)(x) & SPI_INTRST_CS_POSINT_MASK) >> SPI_INTRST_CS_POSINT_SHIFT)

/*
 * SLVCMDINT (W1C)
 *
 * Slave Command Interrupt.
 * This bit is set when Slave Command interrupts occur.
 * (Slave mode only)
 */
#define SPI_INTRST_SLVCMDINT_MASK (0x20U)
#define SPI_INTRST_SLVCMDINT_SHIFT (5U)
#define SPI_INTRST_SLVCMDINT_SET(x) (((uint32_t)(x) << SPI_INTRST_SLVCMDINT_SHIFT) & SPI_INTRST_SLVCMDINT_MASK)
#define SPI_INTRST_SLVCMDINT_GET(x) (((uint32_t)(x) & SPI_INTRST_SLVCMDINT_MASK) >> SPI_INTRST_SLVCMDINT_SHIFT)

/*
 * ENDINT (W1C)
 *
 * End of SPI Transfer interrupt.
 * This bit is set when End of SPI Transfer interrupts occur.
 */
#define SPI_INTRST_ENDINT_MASK (0x10U)
#define SPI_INTRST_ENDINT_SHIFT (4U)
#define SPI_INTRST_ENDINT_SET(x) (((uint32_t)(x) << SPI_INTRST_ENDINT_SHIFT) & SPI_INTRST_ENDINT_MASK)
#define SPI_INTRST_ENDINT_GET(x) (((uint32_t)(x) & SPI_INTRST_ENDINT_MASK) >> SPI_INTRST_ENDINT_SHIFT)

/*
 * TXFIFOINT (W1C)
 *
 * TX FIFO Threshold interrupt.
 * This bit is set when TX FIFO Threshold interrupts occur.
 */
#define SPI_INTRST_TXFIFOINT_MASK (0x8U)
#define SPI_INTRST_TXFIFOINT_SHIFT (3U)
#define SPI_INTRST_TXFIFOINT_SET(x) (((uint32_t)(x) << SPI_INTRST_TXFIFOINT_SHIFT) & SPI_INTRST_TXFIFOINT_MASK)
#define SPI_INTRST_TXFIFOINT_GET(x) (((uint32_t)(x) & SPI_INTRST_TXFIFOINT_MASK) >> SPI_INTRST_TXFIFOINT_SHIFT)

/*
 * RXFIFOINT (W1C)
 *
 * RX FIFO Threshold interrupt.
 * This bit is set when RX FIFO Threshold interrupts occur.
 */
#define SPI_INTRST_RXFIFOINT_MASK (0x4U)
#define SPI_INTRST_RXFIFOINT_SHIFT (2U)
#define SPI_INTRST_RXFIFOINT_SET(x) (((uint32_t)(x) << SPI_INTRST_RXFIFOINT_SHIFT) & SPI_INTRST_RXFIFOINT_MASK)
#define SPI_INTRST_RXFIFOINT_GET(x) (((uint32_t)(x) & SPI_INTRST_RXFIFOINT_MASK) >> SPI_INTRST_RXFIFOINT_SHIFT)

/*
 * TXFIFOURINT (W1C)
 *
 * TX FIFO Underrun interrupt.
 * This bit is set when TX FIFO Underrun interrupts occur.
 * (Slave mode only)
 */
#define SPI_INTRST_TXFIFOURINT_MASK (0x2U)
#define SPI_INTRST_TXFIFOURINT_SHIFT (1U)
#define SPI_INTRST_TXFIFOURINT_SET(x) (((uint32_t)(x) << SPI_INTRST_TXFIFOURINT_SHIFT) & SPI_INTRST_TXFIFOURINT_MASK)
#define SPI_INTRST_TXFIFOURINT_GET(x) (((uint32_t)(x) & SPI_INTRST_TXFIFOURINT_MASK) >> SPI_INTRST_TXFIFOURINT_SHIFT)

/*
 * RXFIFOORINT (W1C)
 *
 * RX FIFO Overrun interrupt.
 * This bit is set when RX FIFO Overrun interrupts occur.
 * (Slave mode only)
 */
#define SPI_INTRST_RXFIFOORINT_MASK (0x1U)
#define SPI_INTRST_RXFIFOORINT_SHIFT (0U)
#define SPI_INTRST_RXFIFOORINT_SET(x) (((uint32_t)(x) << SPI_INTRST_RXFIFOORINT_SHIFT) & SPI_INTRST_RXFIFOORINT_MASK)
#define SPI_INTRST_RXFIFOORINT_GET(x) (((uint32_t)(x) & SPI_INTRST_RXFIFOORINT_MASK) >> SPI_INTRST_RXFIFOORINT_SHIFT)

/* Bitfield definition for register: TIMING */
/*
 * CS2SCLK (RW)
 *
 * The minimum time between the edges of SPI CS and the edges of SCLK.
 * SCLK_period * (CS2SCLK + 1) / 2
 */
#define SPI_TIMING_CS2SCLK_MASK (0x3000U)
#define SPI_TIMING_CS2SCLK_SHIFT (12U)
#define SPI_TIMING_CS2SCLK_SET(x) (((uint32_t)(x) << SPI_TIMING_CS2SCLK_SHIFT) & SPI_TIMING_CS2SCLK_MASK)
#define SPI_TIMING_CS2SCLK_GET(x) (((uint32_t)(x) & SPI_TIMING_CS2SCLK_MASK) >> SPI_TIMING_CS2SCLK_SHIFT)

